In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/1.Quiz.csv")

In [3]:
df

   경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
0   39060    7313    3627     309     300     B
1   39896    6967    4168    1771     350     B
2   42005    6873    4088    1954     450     A
3   43621    6626    4424    2244     560     A
4   41702    8675    4606    3146    1300     A
5   41266   10622    4984    3945    2395     A
6   32427    9228    5570    5766    3786     C

##### index 설정

In [4]:
index_list= ['2011','2012','2013','2014','2015','2016','2017']
df.index = index_list
df

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A
2016   41266   10622    4984    3945    2395     A
2017   32427    9228    5570    5766    3786     C

NameError: name 'index' is not defined

In [6]:
print(df.index,df.dtypes)

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object') 경부선KTX     int64
호남선KTX     int64
경전선KTX     int64
전라선KTX     int64
동해선KTX     int64
경부선등급     object
dtype: object

In [7]:
df.columns

Index(['경부선KTX', '호남선KTX', '경전선KTX', '전라선KTX', '동해선KTX', '경부선등급'], dtype='object')

In [8]:
df.columns=='경부선KTX'

array([ True, False, False, False, False, False])

In [10]:
df['경부선KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선KTX, dtype: int64

In [11]:
df[['경부선KTX','호남선KTX']]

      경부선KTX  호남선KTX
2011   39060    7313
2012   39896    6967
2013   42005    6873
2014   43621    6626
2015   41702    8675
2016   41266   10622
2017   32427    9228

In [12]:
df.loc['2012':'2015']

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

In [13]:
df['2012':'2015']

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

In [17]:
df.loc[ : ,['경부선KTX']]

      경부선KTX
2011   39060
2012   39896
2013   42005
2014   43621
2015   41702
2016   41266
2017   32427

In [18]:
df.loc['2011':'2011',]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B

In [19]:
df.loc['2013':'2016',]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A
2016   41266   10622    4984    3945    2395     A

In [20]:
df.loc['2012':'2014',['경부선KTX']]

      경부선KTX
2012   39896
2013   42005
2014   43621

In [27]:
# loc 사용안하고 위에꺼하는거 모르겠다

In [51]:
df['2012':'2014'][["경부선KTX"]]

      경부선KTX
2012   39896
2013   42005
2014   43621

In [28]:
df.loc['2015':'2017',['경부선KTX','호남선KTX','동해선KTX']]

      경부선KTX  호남선KTX  동해선KTX
2015   41702    8675    1300
2016   41266   10622    2395
2017   32427    9228    3786

In [34]:
df.loc[df['경부선등급'].isin(['B','C'])]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2017   32427    9228    5570    5766    3786     C

In [36]:
df.loc[df['경부선등급'].isin(['B','C']),['경부선KTX']]

      경부선KTX
2011   39060
2012   39896
2017   32427